#СкайПро_Олег_Стрижков_2026_год_Курс_2_Курсовая_работа
#файл с данными создаётся первым в виде:
WORDS_DATA = [
    {
        "word": "питон",
        "subwords": [
            "пони", "тон", "ион", "опт", "пот", "тип", "топ", "пион", "понт"
        ]
    },
    {
        "word": "набор",
        "subwords": [
            "бар", "бон", "бор", "раб", "бра", "боа", "нора", "роба", "барон"
        ]
    },
    {
        "word": "строка",
        "subwords": [
            "акр", "акт", "кот", "рак", "орк", "оса", "сок", "ток", "тор", "кора",
            "коса", "сота", "торс", "роса", "скат", "ока", "рок"
        ]
    }
]
